---
kind: property
id: P:Autodesk.Revit.DB.Mesh.Vertices
source: html/32b34134-9301-f952-a910-5a34d0d0235d.htm
---
# Autodesk.Revit.DB.Mesh.Vertices Property

Retrieves all vertices used to define this mesh. Intended for indexed access.

## Syntax (C#)
```csharp
public IList<XYZ> Vertices { get; }
```